Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.CannotMakeAnalyticalGeometry Property
 Cannot construct Analytical Geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMakeAnalyticalGeometry { get; }
Public Shared ReadOnly Property CannotMakeAnalyticalGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMakeAnalyticalGeometry {
	FailureDefinitionId^ get ();
}
static member CannotMakeAnalyticalGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace